<template>
    <nav class="navbar navbar-expand-lg mynav">
        <div class="container">
            <router-link class="navbar-brand" :to="{name:'Home', query:{page:1}}">
                <svg t="1711091592185" class="icon r-icon" viewBox="0 0 1162 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="11316" width="200" height="200"><path d="M1162 453.2C1162 238.2 901.8 64 581 64S0 238.2 0 453.2C0 644.8 206.6 804 478.8 836.2V960h198.2v-123c48.6-5.4 95.2-14.8 138.8-27.8L896 960h224l-134.8-227.4c109-70.8 176.8-169.8 176.8-279.4z m-933.6 29c0-147 197.8-266 441.6-266s423.8 81.4 423.8 266c0 100.2-53 170-140.6 212.8-4.8-3.2-9.4-5.8-12.8-7.4-20.4-10.4-55.6-21-55.6-21s173.2-12.8 173.2-185.4-181.2-175.8-181.2-175.8h-398V722c-148.2-43-250.4-134.2-250.4-239.8z m450.2 76.6v-111.2c115.6 0 175.6-13.6 175.6 54.6 0 73-76.4 56.6-175.6 56.6z m-1.8 145H730c21.6 0 37.8 23.4 48 38.4-32.2 3.8-66 5.6-101.2 5.8v-44.2z" fill="#2c2c2c" p-id="11317"></path></svg>
                <span style="font-weight: bold;">空间</span>
            </router-link>
            <!-- <a href="/?page="  class="navbar-brand">
                <svg t="1711091592185" class="icon" viewBox="0 0 1162 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="11316" width="200" height="200"><path d="M1162 453.2C1162 238.2 901.8 64 581 64S0 238.2 0 453.2C0 644.8 206.6 804 478.8 836.2V960h198.2v-123c48.6-5.4 95.2-14.8 138.8-27.8L896 960h224l-134.8-227.4c109-70.8 176.8-169.8 176.8-279.4z m-933.6 29c0-147 197.8-266 441.6-266s423.8 81.4 423.8 266c0 100.2-53 170-140.6 212.8-4.8-3.2-9.4-5.8-12.8-7.4-20.4-10.4-55.6-21-55.6-21s173.2-12.8 173.2-185.4-181.2-175.8-181.2-175.8h-398V722c-148.2-43-250.4-134.2-250.4-239.8z m450.2 76.6v-111.2c115.6 0 175.6-13.6 175.6 54.6 0 73-76.4 56.6-175.6 56.6z m-1.8 145H730c21.6 0 37.8 23.4 48 38.4-32.2 3.8-66 5.6-101.2 5.8v-44.2z" fill="#2c2c2c" p-id="11317"></path></svg>
                <span style="font-weight: bold; text-align: center;">空间</span>
            </a> -->
            <button 
                class="navbar-toggler" 
                type="button" 
                data-bs-toggle="collapse" 
                data-bs-target="#navbarText" 
                aria-controls="navbarText" 
                aria-expanded="false" 
                aria-label="Toggle navigation">
                <span class="navbar-toggler-icon"></span>
            </button>
            <div class="collapse navbar-collapse" id="navbarText">
            <ul class="navbar-nav me-auto mb-2 mb-lg-0">
                <li class="nav-item">
                    <router-link class="nav-link mynav-link" :to="{name:'Home', query:{page:1}}">首页</router-link>
                    <!-- <a href="/?page=1"  class="nav-link mynav-link">首页</a> -->
                </li>
                <li class="nav-item" v-if="$store.state.user.is_login">
                    <router-link class="nav-link mynav-link" :to="{name:'Share'}">分享</router-link>
                </li>
                <!-- <li class="nav-item">
                <router-link class="nav-link" href="#">Pricing</router-link>
                </li> -->
            </ul>
            
            <!-- 搜索栏目 -->
            <ul class="navbar-nav" style="padding-right: 8px;">
                <li class="nav-item" style="display: flex; justify-content: space-between; align-items: center;">
                    <el-input
                        maxlength="30"
                        v-model="search_key_word"
                        style="width: 270px"
                        placeholder="对什么感兴趣..."
                        :class="{ 'search-box-visible': isSearchBoxVisible }"
                        @keyup.enter="do_search"
                        clearable
                    />
                    <span class="search-button" @click="toggleSearchBox">
                        <svg t="1712489889176" class="icon original-search-icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1835" width="200" height="200"><path d="M404.210526 0C180.547368 0 0 180.547368 0 404.210526s180.547368 404.210526 404.210526 404.210527c97.010526 0 185.936842-35.031579 256-91.621053 21.557895-16.168421 37.726316-35.031579 56.589474-56.589474 56.589474-70.063158 91.621053-158.989474 91.621053-256 0-223.663158-180.547368-404.210526-404.210527-404.210526z m0 727.578947C226.357895 727.578947 80.842105 582.063158 80.842105 404.210526S226.357895 80.842105 404.210526 80.842105s323.368421 145.515789 323.368421 323.368421-145.515789 323.368421-323.368421 323.368421z" fill="#999999" p-id="1836"></path><path d="M1010.526316 1013.221053c-8.084211 8.084211-18.863158 10.778947-26.947369 10.778947-10.778947 0-21.557895-2.694737-26.947368-10.778947l-293.726316-296.421053c21.557895-16.168421 37.726316-35.031579 56.589474-56.589474l293.726316 296.421053c13.473684 16.168421 13.473684 40.421053-2.694737 56.589474z" fill="#999999" p-id="1837"></path><path d="M716.8 660.210526c-16.168421 21.557895-35.031579 37.726316-56.589474 56.589474l-2.694737-2.694737c-16.168421-16.168421-16.168421-40.421053 0-56.589474 8.084211-8.084211 18.863158-10.778947 26.947369-10.778947 10.778947 0 21.557895 2.694737 32.336842 13.473684z" fill="#999999" p-id="1838"></path></svg>
                        <svg t="1712490364395" class="icon hover-search-icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2163" width="200" height="200"><path d="M404.210526 0C180.547368 0 0 180.547368 0 404.210526s180.547368 404.210526 404.210526 404.210527c97.010526 0 185.936842-35.031579 256-91.621053 21.557895-16.168421 37.726316-35.031579 56.589474-56.589474 56.589474-70.063158 91.621053-158.989474 91.621053-256 0-223.663158-180.547368-404.210526-404.210527-404.210526z m0 727.578947C226.357895 727.578947 80.842105 582.063158 80.842105 404.210526S226.357895 80.842105 404.210526 80.842105s323.368421 145.515789 323.368421 323.368421-145.515789 323.368421-323.368421 323.368421z" fill="#2c2c2c" p-id="2164"></path><path d="M1010.526316 1013.221053c-8.084211 8.084211-18.863158 10.778947-26.947369 10.778947-10.778947 0-21.557895-2.694737-26.947368-10.778947l-293.726316-296.421053c21.557895-16.168421 37.726316-35.031579 56.589474-56.589474l293.726316 296.421053c13.473684 16.168421 13.473684 40.421053-2.694737 56.589474z" fill="#2c2c2c" p-id="2165"></path><path d="M716.8 660.210526c-16.168421 21.557895-35.031579 37.726316-56.589474 56.589474l-2.694737-2.694737c-16.168421-16.168421-16.168421-40.421053 0-56.589474 8.084211-8.084211 18.863158-10.778947 26.947369-10.778947 10.778947 0 21.557895 2.694737 32.336842 13.473684z" fill="#2c2c2c" p-id="2166"></path></svg>
                    </span>
                    <!-- :suffix-icon="Search" -->
                </li>
            </ul>

            <!-- 通知栏目 -->
            <ul class="navbar-nav" v-if="$store.state.user.is_login">
                <li class="nav-item">
                    
                    <!-- <router-link v-if="notifications_count > 0" class="nav-link mynav-link" style="padding-right: 16px;" :to="{name:'Notifications'}">
                        <el-badge :value="notifications_count" class="item">
                            <svg  t="1712485122867" class="icon original-icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1870" width="200" height="200"><path d="M512 42.666667c63.637333 0 116.288 50.432 120.682667 114.005333 103.125333 46.058667 175.552 149.12 175.552 269.696v203.306667C867.477333 677.952 896 741.525333 896 820.458667c0 17.557333-15.36 32.896-32.917333 32.896H640l-0.085333 4.8A128 128 0 0 1 384 853.333333L160.917333 853.333333C143.36 853.333333 128 837.973333 128 820.437333c0-76.736 28.522667-142.506667 87.765333-190.741333v-203.306667c0-120.618667 72.426667-223.658667 175.552-269.717333C395.712 93.098667 448.362667 42.666667 512 42.666667z m64 810.688L448 853.333333l0.106667 3.754667A64 64 0 0 0 576 853.354667zM512 106.666667c-29.525333 0-54.741333 23.914667-56.832 54.421333l-2.645333 38.357333-35.114667 15.68c-83.072 37.077333-137.642667 119.104-137.642667 211.242667v233.749333l-23.594666 19.2c-35.136 28.608-55.744 65.173333-62.08 110.016h635.904l-1.066667-7.082666c-7.210667-41.962667-27.2-75.306667-61.098667-102.933334l-23.594666-19.2V426.368c0-92.16-54.570667-174.165333-137.642667-211.242667l-35.114667-15.68-2.645333-38.357333C566.741333 130.581333 541.525333 106.666667 512 106.666667z" fill="#8A8A8A" p-id="1871"></path></svg>
                            <svg t="1712485122867" class="icon hover-icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1870" width="200" height="200"><path d="M512 42.666667c63.637333 0 116.288 50.432 120.682667 114.005333 103.125333 46.058667 175.552 149.12 175.552 269.696v203.306667C867.477333 677.952 896 741.525333 896 820.458667c0 17.557333-15.36 32.896-32.917333 32.896H640l-0.085333 4.8A128 128 0 0 1 384 853.333333L160.917333 853.333333C143.36 853.333333 128 837.973333 128 820.437333c0-76.736 28.522667-142.506667 87.765333-190.741333v-203.306667c0-120.618667 72.426667-223.658667 175.552-269.717333C395.712 93.098667 448.362667 42.666667 512 42.666667z m64 810.688L448 853.333333l0.106667 3.754667A64 64 0 0 0 576 853.354667zM512 106.666667c-29.525333 0-54.741333 23.914667-56.832 54.421333l-2.645333 38.357333-35.114667 15.68c-83.072 37.077333-137.642667 119.104-137.642667 211.242667v233.749333l-23.594666 19.2c-35.136 28.608-55.744 65.173333-62.08 110.016h635.904l-1.066667-7.082666c-7.210667-41.962667-27.2-75.306667-61.098667-102.933334l-23.594666-19.2V426.368c0-92.16-54.570667-174.165333-137.642667-211.242667l-35.114667-15.68-2.645333-38.357333C566.741333 130.581333 541.525333 106.666667 512 106.666667z" fill="#2c2c2c" p-id="1871"></path></svg>
                        </el-badge>
                    </router-link>

                    <router-link v-if="notifications_count === 0" class="nav-link mynav-link" style="padding-right: 16px;" :to="{name:'Notifications'}">
                        <svg  t="1712485122867" class="icon original-icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1870" width="200" height="200"><path d="M512 42.666667c63.637333 0 116.288 50.432 120.682667 114.005333 103.125333 46.058667 175.552 149.12 175.552 269.696v203.306667C867.477333 677.952 896 741.525333 896 820.458667c0 17.557333-15.36 32.896-32.917333 32.896H640l-0.085333 4.8A128 128 0 0 1 384 853.333333L160.917333 853.333333C143.36 853.333333 128 837.973333 128 820.437333c0-76.736 28.522667-142.506667 87.765333-190.741333v-203.306667c0-120.618667 72.426667-223.658667 175.552-269.717333C395.712 93.098667 448.362667 42.666667 512 42.666667z m64 810.688L448 853.333333l0.106667 3.754667A64 64 0 0 0 576 853.354667zM512 106.666667c-29.525333 0-54.741333 23.914667-56.832 54.421333l-2.645333 38.357333-35.114667 15.68c-83.072 37.077333-137.642667 119.104-137.642667 211.242667v233.749333l-23.594666 19.2c-35.136 28.608-55.744 65.173333-62.08 110.016h635.904l-1.066667-7.082666c-7.210667-41.962667-27.2-75.306667-61.098667-102.933334l-23.594666-19.2V426.368c0-92.16-54.570667-174.165333-137.642667-211.242667l-35.114667-15.68-2.645333-38.357333C566.741333 130.581333 541.525333 106.666667 512 106.666667z" fill="#8A8A8A" p-id="1871"></path></svg>
                        <svg t="1712485122867" class="icon hover-icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1870" width="200" height="200"><path d="M512 42.666667c63.637333 0 116.288 50.432 120.682667 114.005333 103.125333 46.058667 175.552 149.12 175.552 269.696v203.306667C867.477333 677.952 896 741.525333 896 820.458667c0 17.557333-15.36 32.896-32.917333 32.896H640l-0.085333 4.8A128 128 0 0 1 384 853.333333L160.917333 853.333333C143.36 853.333333 128 837.973333 128 820.437333c0-76.736 28.522667-142.506667 87.765333-190.741333v-203.306667c0-120.618667 72.426667-223.658667 175.552-269.717333C395.712 93.098667 448.362667 42.666667 512 42.666667z m64 810.688L448 853.333333l0.106667 3.754667A64 64 0 0 0 576 853.354667zM512 106.666667c-29.525333 0-54.741333 23.914667-56.832 54.421333l-2.645333 38.357333-35.114667 15.68c-83.072 37.077333-137.642667 119.104-137.642667 211.242667v233.749333l-23.594666 19.2c-35.136 28.608-55.744 65.173333-62.08 110.016h635.904l-1.066667-7.082666c-7.210667-41.962667-27.2-75.306667-61.098667-102.933334l-23.594666-19.2V426.368c0-92.16-54.570667-174.165333-137.642667-211.242667l-35.114667-15.68-2.645333-38.357333C566.741333 130.581333 541.525333 106.666667 512 106.666667z" fill="#2c2c2c" p-id="1871"></path></svg>
                    </router-link> -->
                    <router-link v-if="$store.state.user.unread_notification_count > 0" class="nav-link mynav-link" style="padding-right: 16px;" :to="{name:'Notifications'}">
                        <el-badge :value="$store.state.user.unread_notification_count" class="item">
                            <svg  t="1712485122867" class="icon original-icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1870" width="200" height="200"><path d="M512 42.666667c63.637333 0 116.288 50.432 120.682667 114.005333 103.125333 46.058667 175.552 149.12 175.552 269.696v203.306667C867.477333 677.952 896 741.525333 896 820.458667c0 17.557333-15.36 32.896-32.917333 32.896H640l-0.085333 4.8A128 128 0 0 1 384 853.333333L160.917333 853.333333C143.36 853.333333 128 837.973333 128 820.437333c0-76.736 28.522667-142.506667 87.765333-190.741333v-203.306667c0-120.618667 72.426667-223.658667 175.552-269.717333C395.712 93.098667 448.362667 42.666667 512 42.666667z m64 810.688L448 853.333333l0.106667 3.754667A64 64 0 0 0 576 853.354667zM512 106.666667c-29.525333 0-54.741333 23.914667-56.832 54.421333l-2.645333 38.357333-35.114667 15.68c-83.072 37.077333-137.642667 119.104-137.642667 211.242667v233.749333l-23.594666 19.2c-35.136 28.608-55.744 65.173333-62.08 110.016h635.904l-1.066667-7.082666c-7.210667-41.962667-27.2-75.306667-61.098667-102.933334l-23.594666-19.2V426.368c0-92.16-54.570667-174.165333-137.642667-211.242667l-35.114667-15.68-2.645333-38.357333C566.741333 130.581333 541.525333 106.666667 512 106.666667z" fill="#8A8A8A" p-id="1871"></path></svg>
                            <svg t="1712485122867" class="icon hover-icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1870" width="200" height="200"><path d="M512 42.666667c63.637333 0 116.288 50.432 120.682667 114.005333 103.125333 46.058667 175.552 149.12 175.552 269.696v203.306667C867.477333 677.952 896 741.525333 896 820.458667c0 17.557333-15.36 32.896-32.917333 32.896H640l-0.085333 4.8A128 128 0 0 1 384 853.333333L160.917333 853.333333C143.36 853.333333 128 837.973333 128 820.437333c0-76.736 28.522667-142.506667 87.765333-190.741333v-203.306667c0-120.618667 72.426667-223.658667 175.552-269.717333C395.712 93.098667 448.362667 42.666667 512 42.666667z m64 810.688L448 853.333333l0.106667 3.754667A64 64 0 0 0 576 853.354667zM512 106.666667c-29.525333 0-54.741333 23.914667-56.832 54.421333l-2.645333 38.357333-35.114667 15.68c-83.072 37.077333-137.642667 119.104-137.642667 211.242667v233.749333l-23.594666 19.2c-35.136 28.608-55.744 65.173333-62.08 110.016h635.904l-1.066667-7.082666c-7.210667-41.962667-27.2-75.306667-61.098667-102.933334l-23.594666-19.2V426.368c0-92.16-54.570667-174.165333-137.642667-211.242667l-35.114667-15.68-2.645333-38.357333C566.741333 130.581333 541.525333 106.666667 512 106.666667z" fill="#2c2c2c" p-id="1871"></path></svg>
                        </el-badge>
                    </router-link>

                    <router-link v-if="$store.state.user.unread_notification_count === 0" class="nav-link mynav-link" style="padding-right: 16px;" :to="{name:'Notifications'}">
                        <svg  t="1712485122867" class="icon original-icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1870" width="200" height="200"><path d="M512 42.666667c63.637333 0 116.288 50.432 120.682667 114.005333 103.125333 46.058667 175.552 149.12 175.552 269.696v203.306667C867.477333 677.952 896 741.525333 896 820.458667c0 17.557333-15.36 32.896-32.917333 32.896H640l-0.085333 4.8A128 128 0 0 1 384 853.333333L160.917333 853.333333C143.36 853.333333 128 837.973333 128 820.437333c0-76.736 28.522667-142.506667 87.765333-190.741333v-203.306667c0-120.618667 72.426667-223.658667 175.552-269.717333C395.712 93.098667 448.362667 42.666667 512 42.666667z m64 810.688L448 853.333333l0.106667 3.754667A64 64 0 0 0 576 853.354667zM512 106.666667c-29.525333 0-54.741333 23.914667-56.832 54.421333l-2.645333 38.357333-35.114667 15.68c-83.072 37.077333-137.642667 119.104-137.642667 211.242667v233.749333l-23.594666 19.2c-35.136 28.608-55.744 65.173333-62.08 110.016h635.904l-1.066667-7.082666c-7.210667-41.962667-27.2-75.306667-61.098667-102.933334l-23.594666-19.2V426.368c0-92.16-54.570667-174.165333-137.642667-211.242667l-35.114667-15.68-2.645333-38.357333C566.741333 130.581333 541.525333 106.666667 512 106.666667z" fill="#8A8A8A" p-id="1871"></path></svg>
                        <svg t="1712485122867" class="icon hover-icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1870" width="200" height="200"><path d="M512 42.666667c63.637333 0 116.288 50.432 120.682667 114.005333 103.125333 46.058667 175.552 149.12 175.552 269.696v203.306667C867.477333 677.952 896 741.525333 896 820.458667c0 17.557333-15.36 32.896-32.917333 32.896H640l-0.085333 4.8A128 128 0 0 1 384 853.333333L160.917333 853.333333C143.36 853.333333 128 837.973333 128 820.437333c0-76.736 28.522667-142.506667 87.765333-190.741333v-203.306667c0-120.618667 72.426667-223.658667 175.552-269.717333C395.712 93.098667 448.362667 42.666667 512 42.666667z m64 810.688L448 853.333333l0.106667 3.754667A64 64 0 0 0 576 853.354667zM512 106.666667c-29.525333 0-54.741333 23.914667-56.832 54.421333l-2.645333 38.357333-35.114667 15.68c-83.072 37.077333-137.642667 119.104-137.642667 211.242667v233.749333l-23.594666 19.2c-35.136 28.608-55.744 65.173333-62.08 110.016h635.904l-1.066667-7.082666c-7.210667-41.962667-27.2-75.306667-61.098667-102.933334l-23.594666-19.2V426.368c0-92.16-54.570667-174.165333-137.642667-211.242667l-35.114667-15.68-2.645333-38.357333C566.741333 130.581333 541.525333 106.666667 512 106.666667z" fill="#2c2c2c" p-id="1871"></path></svg>
                    </router-link>
                </li>
            </ul>

            <ul class="navbar-nav" v-if="!$store.state.user.is_login">
                <li class="nav-item">
                    <router-link class="nav-link mynav-link" :to="{name:'Login'}">登录/注册</router-link>
                </li>
            </ul>

            <!-- 登录成功后，显示用户头像，以及用户名称 -->
            <ul class="navbar-nav" v-else>
                <!-- <li class="nav-item">
                    <router-link class="nav-link" :to="{name:'Login'}">退出</router-link>
                </li> -->
                <div class="nav-item dropdown">
                    <a class="nav-item dropdown-toggle mynav-link" href="#" role="button" data-bs-toggle="dropdown" aria-expanded="false">
                        <img class="img-fluid avatar" :src="$store.state.user.avatar" alt="">
                        {{$store.state.user.username}}
                        <!-- <div class="mynav-link">{{$store.state.user.username}}</div> -->
                    </a>

                    <ul class="dropdown-menu">
                        <li><router-link class="dropdown-item" :to="{name:'Profile', params:{userid:$store.state.user.id}}">个人中心</router-link></li>
                        <!-- <li><div class="dropdown-item" @click="enterProfile($store.state.user.id)">个人中心</div></li> -->

                        <li><router-link class="dropdown-item" :to="{name:'ProfileStar', params:{userid:$store.state.user.id}}">我的收藏</router-link></li>
                        
                        <li><hr class="dropdown-divider"></li>
                        <li><router-link class="dropdown-item" :to="{name:'Login'}" @click="logout">退出</router-link></li>
                    </ul>
                </div>
            </ul>

            </div>
        </div>
    </nav>
</template>


<script>

import { useStore } from 'vuex'
// import router from '@/router/index';   //@定位src目录
import { ElMessage } from 'element-plus';
import {ref} from 'vue'
import {BackendRootURL,} from '../common_resources/resource';
import $ from 'jquery'
export default{
    name:"Navbar",
    setup(){
        const store = useStore()
        const logout = ()=>{
            store.commit('logout');//调用user.js全局里面mutations里面的函数用commit
            store.commit('logout_page')
        }

        
        //搜索关键词
        const search_key_word = ref('')
        const isSearchBoxVisible = ref(true)
        const toggleSearchBox = ()=>{
            isSearchBoxVisible.value = !isSearchBoxVisible.value
            // console.log(isSearchBoxVisible.value)
        }

        const do_search = ()=>{
            if(search_key_word.value === '' || /^\s*$/.test(search_key_word.value)) {
                ElMessage.warning("搜索内容不能为空")
                return 
            }
            console.log(search_key_word.value)
        }
        // const enterProfile = (user_id)=> {
        //     router.push({
        //         name:"Profile",
        //         params:{
        //             userid:user_id,
        //         }
        //     })
        // }
        

        
        

        //通知消息数量(刷新一次获取一次，然后点击一次之前未查看消息，就减一)
        // 获取未读取的信息数
        const getUnreadNotificationsCount = ()=>{
            $.ajax({
                url: BackendRootURL + "/notification/getunreadnotificationcount/",
                type:"GET",
                headers: {
                    'Authorization': "Bearer " + store.state.user.jwt,
                },
                success(resp){
                    // notifications_count.value = resp.data
                    store.commit("updateUnreadNotificationCount", resp.data)
                }
            })
        }

        // 未登录不能获取未读通知数量
        if(store.state.user.is_login === true) {
            getUnreadNotificationsCount()
        }
        



        return {
            search_key_word,
            // notifications_count,
            isSearchBoxVisible,
            toggleSearchBox,
            do_search,
            logout, 
            // enterProfile,
        }
    }
}


</script>


<style scoped>


.avatar{
    width: 30px; 
    height: 30px; 
    border-radius: 50%;
}

a{
    text-decoration: none; /* 取消下划线 */
    color: black; /* 修改字体颜色，这里以红色为例 */
}

.mynav{
    background-color: white;
    /* background-color: #F7F7F7; */
    position: fixed;
    top: 0;
    width: 100vw;
    z-index: 1000;
}

.r-icon {
    max-width: 30px;
    max-height: 30px;
}

.mynav-link{
    color: rgb(107, 107, 107);
}

.mynav-link:hover{
    color: black;
}

.original-search-icon {
    display: block;
    /* margin-top: 3px; */
    max-width: 25px;
    max-height: 25px;
}

.hover-search-icon {
    display: none;
    /* margin-top: 3px; */
    max-width: 25px;
    max-height: 25px;
}

.search-button:hover .original-search-icon {
    display: none;
}

.search-button:hover .hover-search-icon {
    display: block;
}

.original-icon {
    display: block;
    max-width: 25px;
    max-height: 25px;
}

.hover-icon {
    display: none;
    max-width: 25px;
    max-height: 25px;
}

.mynav-link:hover .original-icon {
    display: none;
}

.mynav-link:hover .hover-icon {
    display: block;
}




.search-button{
    cursor: pointer;
    max-width: 25px;
    max-height: 25px;
}

.search-box-visible {
    position: absolute;
    right: 0;
    transform: translateX(100%);
    overflow: hidden;
    max-width: 0;
}

.search-box-visible.show {
    transform: translateX(-100%);
    max-width: 270px;
}


</style>